[{"story": "Yesterday, a coworker told me that he'd be making pizza (broccoli rabe and italian sausage). We had a lengthy conversation about whether he should add sauce to it. Today, I got an ad on Twitter for that same kind of pizza on my personal computer (not my work laptop).", "video": "https://saaaam.s3.amazonaws.com/organs_v/00005.mp4.webm", "id": "5"}, {"story": "I told a friend about a story I had published (I’m a writer) six months before, and spoke the name of the brand Speedo. That evening when I went online I was besieged with Speedo ads.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00008.mp4.webm", "id": "8"}, {"story": "A coworker sent me a photo of his new keyboard he had bought (we had talked about it over voice, no typing) and from then on, I would see advertisements for this very specific keyboard!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00011.mp4.webm", "id": "11"}, {"story": "I was listening to a podcast and they briefly mentioned CoQ10. It was not in the title or the description of the podcast. I have never talked about or searched for CoQ10. The same day, I started seeing ads for CoQ10.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00018.mp4.webm", "id": "18"}, {"story": "I was refilling a prescription for hydrochlorothiazide and researching high blood sugar causes at the same time. Google pops up and showed a link between the prescription and high blood sugar.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00028.mp4.webm", "id": "28"}, {"story": "I just randomly checked the price of a hard disk on my browser. I kept seeing ads for it on my social media platforms for many days.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00030.mp4.webm", "id": "30"}, {"story": "My sister and I were talking over coffee about her need for a water softener, and I told her about the company Culligan Man. Lo and behold, ads for Culligan Man started showing up in the banner above my email, and on my Facebook sidebar. I never did any web searches for it.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00037.mp4.webm", "id": "37"}, {"story": "I was joking with a friend in a private Facebook message about being undocumented in France (sans-papier) and immediately started seeing ads on other websites for immigration lawyers and services to send money home.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00040.mp4.webm", "id": "40"}, {"story": "Everytime I go to Facebook, I get ads related to my phone, brand and model.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00042.mp4.webm", "id": "42"}, {"story": "Never heard of, read about, or searched for escape rooms. I skyped with my mom and she told me how my sister went to one for a work outing. A day or two later I'm getting ads for a local one on facebook.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00046.mp4.webm", "id": "46"}, {"story": "My phone was on the table and a friend and I were discussing dog breeds. I have no dog and never searched for anything animal-related. In about an hour an ad for dog food appeared on my phone!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00052.mp4.webm", "id": "52"}, {"story": "A couple years ago I was talking to a friend, our smartphones in front of us, about how I realized I might be allergic to pasta because it always makes me cranky and bloated. I was also telling her that, as much as I love the taste of it, oily marinara sauce gives me a stomach ache. Later that same day and for several days following, I saw ads on my Facebook page and Google search results for pasta and marinara sauce.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00063.mp4.webm", "id": "63"}, {"story": "Had a (drunken) conversation with my sisters about disgusting toilet brushes. No searches or anything, but my phone was in my pocket, microphone, location always disabled. About 2 hrs later on Facebook, an advert popped up for a toilet brush.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00068.mp4.webm", "id": "68"}, {"story": "I was telling my boyfriend about a kebab place that I heard about, ahead of his visit in another city. I had never searched for that particular place. The next day, I saw an ad on Instagram for that place.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00069.mp4.webm", "id": "69"}, {"story": "I was talking over discord with a friend and she recommended a book by a Portuguese author I'd previously never heard of (Blindness by José Saramago - it is rather good).\nThe next day the book was being advertised to me online in sidebar ads.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00076.mp4.webm", "id": "76"}, {"story": "The Twitter app in my windows computer displayed an article about a game I was just playing on the phone.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00078.mp4.webm", "id": "78"}, {"story": "I took a screenshot of a pineapple shirt from a website on my phone, then sent that image to a friend via text message. The next day, the ads in my Facebook feed were all for pineapple-related clothes and accessories.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00079.mp4.webm", "id": "79"}, {"story": "I was talking to my husband about painting our furniture. I settled on yellow, teal, and a nice green. Later that day, I went on Amazon to purchase my daughter's birthday gift? All my recommendations were for yellow home items, green home items, and teal items.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00080.mp4.webm", "id": "80"}, {"story": "I need a blue dress, and I see countless ads for blue dresses.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00087.mp4.webm", "id": "87"}, {"story": "I keep seeing ads and profiles on the web and in Facebook/Instagram of people that I met once in my life, even if these people are not related to anyone.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00089.mp4.webm", "id": "89"}, {"story": "Waitress talks about oat milk, and oak milk ads show for a few months.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00093.mp4.webm", "id": "93"}, {"story": "Checked United Airlines for flights to Paris on my desktop computer, and started getting hotel ads for Paris within a couple of hours.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00103.mp4.webm", "id": "103"}, {"story": "My wife and I have a friend who lives in the Pueblo Zuni. Zuni are wonderful artists and carvers. They specialize in “fetishes” for religious purposes. However when my wife searched for fetish online she received quite a differentnt response for several weeks. Quite educational!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00107.mp4.webm", "id": "107"}, {"story": "I work in an old hotel and was texting my boss about the bed-bug exterminator then, within 20 minutes, I get an email from terminix.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00115.mp4.webm", "id": "115"}, {"story": "I purchased Boar's Head sliced turkey at a local market and paid with a Paypal credit card. Shortly thereafter I started seeing Facebook ads for Boar's Head mentioning the name of the market.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00124.mp4.webm", "id": "124"}, {"story": "I was at the grocery store with a friend, and she noticed a protein bar that she hadn't seen in awhile (they were RXBARs). I had never heard of them, and she had never mentioned them to me before. She never actually mentioned the brand name. Later that afternoon, I got an Instagram ad for RXBARs.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00132.mp4.webm", "id": "132"}, {"story": "My boyfriend and I were in his car driving around. We got onto a topic of sexual tastes and I happened to say \"It might be nice if you dress up as a cowboy\", and right after I said that, his phone announces, \"cowboy boots locations on your route home\" and lists the nearest location.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00139.mp4.webm", "id": "139"}, {"story": "I have one disgusting ad that has been following me around on my web searches for several years since I turned 60: “90 year old woman looks 50”. I’ve changed my age on Facebook and use adblockers but it still manages to get through sometimes!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00140.mp4.webm", "id": "140"}, {"story": "I usually have location switched off on my Android phone, and I hadn't ever searched for travel on my phone, but then one day when I started searching for buses and trains, my phone knew that Norwich was my home station.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00163.mp4.webm", "id": "163"}, {"story": "One day my husband and I were sitting on the couch, and I told him out of the blue, \"I wanna play the drums\". Sure enough, later that evening chrome popped up with ads for drum kits!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00167.mp4.webm", "id": "167"}, {"story": "I was working on my bandsaw when the blade broke. When I opened my computer there was an ad from Amazon for replacement blades for the exact bandsaw that I use.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00168.mp4.webm", "id": "168"}, {"story": "I am not sure if it's a coincidence or not, but there have been numerous cases when I discuss a particular person with a friend and within the same day I get a friend suggestion for the very same person on my wall.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00170.mp4.webm", "id": "170"}, {"story": "Ads have popped up for items that friends have sent me with screen shots, so no links, just pictures.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00180.mp4.webm", "id": "180"}, {"story": "I use Grindr (Gay Dating app) and once saw an ad for fixing erectile dysfunction (had a flacid cactus). The same day at work, I opened Pandora.com (internet radio) and saw the EXACT SAME AD!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00188.mp4.webm", "id": "188"}, {"story": "Was looking for sport shoes. Talked by phone with my brother, brands, types. Then tons of  sport shoe ads appear in my computer.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00190.mp4.webm", "id": "190"}, {"story": "When I had an Amazon Echo, even with all the privacy settings I could change, I would find that a day after having a conversation with someone in my home I would start seeing ads for things that were mentioned.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00192.mp4.webm", "id": "192"}, {"story": "I often buy cat litters and cat food from pet shops. One day, while I was taking photos through an app, I saw a pop up ad asking me if I'm interested in buying cat food. This was quite creepy to me.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00205.mp4.webm", "id": "205"}, {"story": "I went to a Bed Bath and Beyond, looking for a lighted mirror, specifically that item and  no other. The next day on Facebook, ads appeared showing me lighted mirrors.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00210.mp4.webm", "id": "210"}, {"story": "I was talking to someone about getting shoe covers, of all things, in attempt to keep my shoes clean while I was going to help clean a burnt house. A day later, an ad showed up for shoe covers on reddit.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00216.mp4.webm", "id": "216"}, {"story": "I like tunics, and I like to craft and quilt and knit.  It seems as if every website I now visit will have a picture of a tunic, or a sewing machine, or a fabric store , a yarn shop, or knitting needles on it.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00218.mp4.webm", "id": "218"}, {"story": "I used a private desktop browser to investigate symptoms and signs of HPV. Only one person knows about this. Almost immediately afterward, I began receiving daily ads in my mobile Twitter app about HPV awareness.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00220.mp4.webm", "id": "220"}, {"story": "I rather resented that when I turned 60 my Facebook page became peppered with adverts for incontinence pants. There is still life in this old dog, but I take care when I cough nowadays!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00223.mp4.webm", "id": "223"}, {"story": "I have a friend from Newcastle in the UK who uses the colloquiol phrase \"bosh\" as an affirmation that something is good. For example, \"that burger was bosh\". My friends and I use this word a lot to describe things, because we find it such a funny turn of phrase. In the past 2 years I've personally had targeted ads for professional standard power tools and the like manufactured by the company Bosch.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00234.mp4.webm", "id": "234"}, {"story": "A cousin stopped in from Arizona - I’m in Wyoming. We were telling weird food combo stories. I told of one I used to eat in high school back in 1979. Suddenly that week I was inundated with ads for Yoplait & Doritos.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00236.mp4.webm", "id": "236"}, {"story": "I see ads related to subject matter taught in school.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00237.mp4.webm", "id": "237"}, {"story": "Instagram recommended me an account that specialised in giving relationship counseling for lesbians. I have never been out on Instagram or even liked any lesbian content! It seemed Instagram inferred that from the people I follow.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00248.mp4.webm", "id": "248"}, {"story": "Me and my wife are parents of two boys. Joking around, we were thinking how it would it be if we have another kid, since we gave away all the toddler things. After that, ads started to suggest baby strollers and bath tubs.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00251.mp4.webm", "id": "251"}, {"story": "40 minutes after a heated argument with my husband, I started receiving instagram ads offering marital advice and promoting ways to keep your man. It was super creepy! Specially because up to that point FB or Instagram did not know that I was married (I never updated my profile) and all the ads were all about how to catch a man, how to seduce a man...", "video": "https://saaaam.s3.amazonaws.com/organs_v/00253.mp4.webm", "id": "253"}, {"story": "Met someone in the bar, talked to him for some time, next day he appears in \"people you may know\".", "video": "https://saaaam.s3.amazonaws.com/organs_v/00268.mp4.webm", "id": "268"}, {"story": "Recently I was having a conversation with a friend who acquired Portuguese citizenship. My phone's data was off. Later in the day when data was turned on, I received a mail in my Gmail account about investing in a house in Portugal!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00271.mp4.webm", "id": "271"}, {"story": "After deactivating my phone, I got an email from Facebook saying people could no longer use my number for messanger. I had deleted messanger from my phone 8 months ago. There was no reason for Facebook to know I had deactivated my phone.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00275.mp4.webm", "id": "275"}, {"story": "I was in a taxi and the driver was having a phone conversation with an insurance company about car finance. A few hours later Yahoo showed me a sponsored ad for car finance. I don't own a car, I have no interest in cars, I never search for info about cars.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00276.mp4.webm", "id": "276"}, {"story": "I had just baked some cookies using a special mix. Thirty minutes later, I saw an ad on a website to buy more of the cookie mix on Amazon. How did the Internet know I had just baked those cookies and was out of the mix?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00278.mp4.webm", "id": "278"}, {"story": "I was talking with my father about politics and Guatemala was brought up. After brainstorming about the name of the actual president of that country, I decided to look at my phone and do a quick search. After I typed \"pre\" in the search bar, the first suggestion was \"president of guatemala Jimmy Morales\". I freaked a little bit while my father remained skeptical.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00281.mp4.webm", "id": "281"}, {"story": "I wanted to buy some shoes. So I went to a store named Bata, however I didn't liked their pricing so I came back to my house. Literally 2 hour later I saw ads on Facebook from Bata about the same shoes providing a discount.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00283.mp4.webm", "id": "283"}, {"story": "I texted with a former colleague about getting together for lunch. We agreed on a date. When I went to my calendar, after I put in lunch, the rest, including her name, was automatically filled in. Is that creepy or what?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00289.mp4.webm", "id": "289"}, {"story": "I am over 65 years old but I tend to look at political activist sites, fashion sites and listen to music that is of interest to much younger people, yet I get ads targeted to older people. Weird ads - life insurance, retirement, health stuff - that kind of shite.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00296.mp4.webm", "id": "296"}, {"story": "Was at a retail store and said out loud how much I liked a certain brand. Later that day, an ad for that brand popped up on Facebook. The odd thing was that I hadn’t seen that brand since childhood.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00305.mp4.webm", "id": "305"}, {"story": "I have seen ads on Facebook that show things I have looked at on other websites, like if I look at something on ebay it will show up there with the caption \"still interested? take another look\".", "video": "https://saaaam.s3.amazonaws.com/organs_v/00310.mp4.webm", "id": "310"}, {"story": "One day a consultant visited our company, we talked moves, a specific scene from Rush Hour. About an hour later that same scene appeard in my Facebook feed from a 9Gag feature.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00311.mp4.webm", "id": "311"}, {"story": "I had a car accident a few months ago, and my insurance didn't cover the expenses of my damage. So we discussed it for a couple of days at my home, one day out of nowhere i started getting adds about car insurance and car crashes on the Instagram app. I've never googled anything related or even close to that, so it was pretty weird.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00317.mp4.webm", "id": "317"}, {"story": "I was talking to a friend about a lecture related to studying abroad. Hours later I started browsing and I got ads from different organizations offering education in different countries.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00319.mp4.webm", "id": "319"}, {"story": "I was grocery shopping. There was loud music playing. My android phone was in my purse. Suddenly, Google pipes up on my phone and asks me if I would like to know the name of the song being played.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00321.mp4.webm", "id": "321"}, {"story": "I was talking to my brother about getting gas one morning. When I opened up maps, it had already found the nearest Costco gas station for me.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00326.mp4.webm", "id": "326"}, {"story": "When I play games on my phone, I get two different ads for the same driving school very frequently, and they have a location I walk past regularly.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00331.mp4.webm", "id": "331"}, {"story": "Idly reading a couple stories online at work, and an ad pops up for intimate apparel I had looked up once several months back as a joke.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00339.mp4.webm", "id": "339"}, {"story": "Never been on a cruise. Never fancied. Never searched for a holiday cruise online. One day was talking with my friends at work about a cruise and she googled a few offers on the work computer. My mobile was few meters away. After comming back home I saw adverts of cruises.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00347.mp4.webm", "id": "347"}, {"story": "I can basically use instagram ads as a casual period tracker. I have been served pad and tampon ads a few days before I get my period for the last few months.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00349.mp4.webm", "id": "349"}, {"story": "My fiancée and I had an argument over the phone and discussed ending our engagement. Within two days I was seeing ads on sites and Facebook selling an engagement ring.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00361.mp4.webm", "id": "361"}, {"story": "I was in the store with my mother. She mentioned a specific brand of pasta that her birds love eating. And that if I came across it to pick some up. I didn't even have my phone out of my purse. The very next day there was an ad for that specific brand of pasta on my phone.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00362.mp4.webm", "id": "362"}, {"story": "Went to a seminar on CBD oil for use with anxiety, now getting adds for anxiety and depression cures.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00375.mp4.webm", "id": "375"}, {"story": "Was shopping for a tent for my partner on my own computer. He then started seeing ads for tents on his computer.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00379.mp4.webm", "id": "379"}, {"story": "I was talking to a friend over Facebook Messenger about Universal Basic Income, she had no idea what it was. A moment later Facebook served her an ad talking about Universal Basic Income. It's creepy thinking that my personal conversations are being read, even by a computer.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00385.mp4.webm", "id": "385"}, {"story": "Once, I was speaking to a friend on the phone about my struggle learning French, about how I never finished with my class. I dropped the call. My phone beeped. It was a message from my service provider about learning French via SMS. That was creepy, really creepy.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00388.mp4.webm", "id": "388"}, {"story": "I went to England a few years ago. I did not take my computer. However, I received spam from England for 3 plus years afterwards.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00392.mp4.webm", "id": "392"}, {"story": "Coworker described a gift she got for a friend, for Christmas. I responded quite enthusiastically and said I’d love one. BAM! I shit you not, I had an email from Amazon the next day with the exact link to THAT product. Creeped us both out.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00398.mp4.webm", "id": "398"}, {"story": "It is very disturbing that whenever I buy something online, Facebook, Yahoo know it right away, and incite me to look at others vendors telling me that because I bought one item I could be interested by other items.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00399.mp4.webm", "id": "399"}, {"story": "The refrigerator in my house has a serious defect. My wife and I talked about it while her cell phone was on the floor beside the sofa. After some time she decided to pick up the smartphone and the first ad that appeared was an offer for a duplex refrigerator.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00422.mp4.webm", "id": "422"}, {"story": "My husband and daughter were talking about getting a horse. All of a sudden I started seeing horse advertisements on Facebook and Google, and I actually received a horsemanship magazine in the mail.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00433.mp4.webm", "id": "433"}, {"story": "I shop from home on one email address, and never use my work email address for shopping. However, shortly after purchasing a pair of boots from home, an ad popped up at work with the same boots. Accused of shopping while at work, it was really hard to deny, since I was actually wearing the boots in the ad. How did that happen?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00442.mp4.webm", "id": "442"}, {"story": "There was a time when I was just thinking of going on a vacation and voila! The next thing I see are vacation packages for the same place that I had just been thinking about. I hadn't started any research about it. How did it know?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00445.mp4.webm", "id": "445"}, {"story": "Facebook advertising seemingly knew I was queer before I had told anybody.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00451.mp4.webm", "id": "451"}, {"story": "Basic search on google for midi keyboards. Visited a couple of sites. Even though I've deleted my browsing history, cookies, temp files, and stuf like that, every time I visit almost any site ads related to midi keyboards pops up. Strange, isn't it?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00461.mp4.webm", "id": "461"}, {"story": "I was googling for food grade steel water bottle brands, and as soon as I closed the browser on my desktop, I received an SMS from an unknown number with a message \"Looking for steel water bottles in  <mylocation>\".", "video": "https://saaaam.s3.amazonaws.com/organs_v/00467.mp4.webm", "id": "467"}, {"story": "I was at the Athens airport near some self-service ticket machines when a German asked me something about Ryanair.  Half an hour later I got on the plane and Ryanair's App was first in Siri's \"suggestions\".", "video": "https://saaaam.s3.amazonaws.com/organs_v/00471.mp4.webm", "id": "471"}, {"story": "A friend gave me the book Game of Thrones, and another friend told me that they recently went to Jordan. The same day I get an email from Amazon offering me Game of Thrones and a travel guide to Jordan. How could they have known?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00477.mp4.webm", "id": "477"}, {"story": "Things I discuss in whatsapp conversations show up in facebook ads.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00484.mp4.webm", "id": "484"}, {"story": "I'm at my desk at a co-working spot in Austin, TX. A colleague comes up, asks me verbally in the real world: \"Say, have you got an iPhone charger\"? SECONDS later, I was served an ad for an iPhone charger over the browser being used on my work laptop. I'd never searched for one, bought one, owned one or even considered having an iPhone or iPhone charger.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00495.mp4.webm", "id": "495"}, {"story": "I was at my mother in law's at Christmas and received a gift, iittala candle holders from her daughter's ex who also was there. Some hours later there were ads in my Facebook page from iittala.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00503.mp4.webm", "id": "503"}, {"story": "Had a discussion about meditation. It was pretty long discussion, and few times my wife said that it would be nice to try. After few days my wife noticed that she started getting advertisement in Instagram about meditation courses.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00506.mp4.webm", "id": "506"}, {"story": "Having recently moved and now heading into summer, I pondered if a certain type of A/C would work given my type of windows. Suddenly I am being fed ads for it non stop! Never searched. It was just a passing thought. Freaky.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00518.mp4.webm", "id": "518"}, {"story": "Yesterday I went out and bought a pair of Adidas using a debit card. Today there are ads for Adidas on my email site. Am I being paranoid? This is just weird, really weird.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00546.mp4.webm", "id": "546"}, {"story": "There’s this website that is targetting my IP. Each time I buy a product or search a product on their site, all my family members get ads for the same products.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00553.mp4.webm", "id": "553"}, {"story": "I got married quite suddenly, and due to circumstances surrounding the speed of the wedding, I didn't broadcast the fact on any social media platforms, though I did make several phone calls to close friends and family informing them of the good news. Around the same time I had a random discussion with a friend about how I'd like to visit Japan one day. Suddenly I started getting targeted ads on Instagram for honeymoon holiday offers in Japan.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00554.mp4.webm", "id": "554"}, {"story": "Last summer my husband and I had a knockdown, drag-out fight within listening distance of my smartphone. A few hours later I got some ads for divorce attorneys. A few months ago we actually split up, and now I get ads for grief counselors.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00560.mp4.webm", "id": "560"}, {"story": "When using Twitter, I noticed that after me and a friend had been talking about a specific brand or product in private (DMs) ads would show up for it.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00565.mp4.webm", "id": "565"}, {"story": "My wife has started seeing adds for things I've searched for on amazon and elsewhere, even though we use separate PCs and do not have the same family name online or shared 'relationship status' for facebook.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00568.mp4.webm", "id": "568"}, {"story": "I had to go for an emergency dental visit. Suddenly ads for whitening toothpaste, dentists in my area, and electric toothbrushes filled my screen!", "video": "https://saaaam.s3.amazonaws.com/organs_v/00569.mp4.webm", "id": "569"}, {"story": "I woke up in the middle of the night having trouble sleeping, opened some web page, and on that web page there was an ad for treatment for sleep disorders.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00578.mp4.webm", "id": "578"}, {"story": "I was out shopping with my mom and decided to buy a new gillete razor because my current one gave me razor burn. Afterwards on instagram I see a gillete ad, which I have never seen on the app before.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00581.mp4.webm", "id": "581"}, {"story": "I had a big fight with my boyfriend and we were on the brink of a break-up. He was ignoring my texts and it made me so anxious. I needed someone to comfort me, so my best friend came over to my house and she listened to my rants and stories. After a few hours, she browsed through her YouTube app on her phone, and found that her recommended video to watch was \"what a man is thinking if he's ignoring you\".", "video": "https://saaaam.s3.amazonaws.com/organs_v/00592.mp4.webm", "id": "592"}, {"story": "Talking with my sister in a location with no broadband/wifi inside about needing to borrow an electric screwdriver for a project. Neither of us researched this before or after. That same day I had an ad pop up for electric screwdrivers on Amazon.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00595.mp4.webm", "id": "595"}, {"story": "I think my Android phone listens to me. If I'm talking about something or watching a TV show and then I go to search something related, the first autocompleted search results will always be about what I was just talking about.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00616.mp4.webm", "id": "616"}, {"story": "My cat was being bad and acting crazy. I said to him in my \"talking to cat voice\" that he was a \"Wild Boy\" multiple times. Youtube app suggests I watch \"Wild Boyz\".", "video": "https://saaaam.s3.amazonaws.com/organs_v/00622.mp4.webm", "id": "622"}, {"story": "While I was visiting my parents, I had a short conversation with my mother about how bad my posture was, and she suggested that I get one of those posture braces. A day or so passes. When I opened Instagram later, the first thing on my timeline was a sponsored post from primate.co, a company that sells posture braces.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00629.mp4.webm", "id": "629"}, {"story": "I was watching “designated survivor” on Amazon (fire stick), and there was a tiny scene where someone gifts the president a bottle of wild turkey whiskey. It seemed like obvious ad placement. 20 minutes later I saw a wild turkey ad in my instagram. Never expressed any interest in whiskey/alcohol online.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00632.mp4.webm", "id": "632"}, {"story": "So the other day I was talking to one of my friends about what should we order for our dinner. Later that day, I start seeing ads promoting the same dish we wanted to try.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00636.mp4.webm", "id": "636"}, {"story": "I heard that maybe the Phone is listening and did a test. I turned off all apps and started congratulating my wife on her pregnancy and how excited I was. I went on for 5 minutes about all the stuff I needed to buy and then opened a webpage for a newspaper and it was full of ads for pregnancy courses and baby stuff.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00640.mp4.webm", "id": "640"}, {"story": "My friend and I were texting about Olive Garden and how I would never go there. Then I told my husband, in person, about my text conversation with my friend about Olive Garden. I started getting Instagram ads for Olive Garden. I hadn't looked up Olive Garden because of how much I don't ever plan on going.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00648.mp4.webm", "id": "648"}, {"story": "My parents told me that their washer was broken. Two weeks from that day on almost every app showed me ads for new washers.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00660.mp4.webm", "id": "660"}, {"story": "My boyfriend is starting his own sock company, and ever since he told me about his project, I see sock ads everywhere and I've never searched socks before.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00670.mp4.webm", "id": "670"}, {"story": "My in-laws are in the process of moving on to our property.  Yesterday we verbally discussed the need to call PODS (the moving/storage company), to arrange the delivery of their stored stuff. Lo and behold, guess what ads appeared twice in my Facebook feed and once in my gmail promotions tab?  PODS.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00698.mp4.webm", "id": "698"}, {"story": "Earlier this year, my close friend gave me a Masamoto KS series knife from Japan as a gift. That evening, as I was lying in bed scrolling through Instagram, an ad popped up suggesting that I buy that very same knife. I hadn’t Googled the knife, taken a picture of it, or even sent a text about it.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00701.mp4.webm", "id": "701"}, {"story": "I receive Hollister ads on Spotify, which is a clothing store I regularly shop at. They still found me even though I use tracking protection.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00711.mp4.webm", "id": "711"}, {"story": "Mr phone browser auto searched for LSD during a discussion about magic mushrooms. I thought I'd turned all OK google shit off.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00713.mp4.webm", "id": "713"}, {"story": "I bought a pair of very weird/unique shoes from a thrift store. I did not take a picture or send anything about them over my phone. I put them on my feet and showed my boyfriend in person when he got home from work. A few hours later, HE got an instagram ad featuring the same exact shoes.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00714.mp4.webm", "id": "714"}, {"story": "I went to Wal-Mart to get some shitty coffee. I picked up some Gevalia. Before this, I'd never uttered the word. Lo and behold, the next day, I wake up to find an Instagram ad for Gevalia coffee. This has happened in various forms over the years. I have become used to it, and complacent.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00717.mp4.webm", "id": "717"}, {"story": "I got Instagram ads for lunchables after I bought some for the first time in years, then a week later I told my brother about it out loud, and the next day got more lunchables ads.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00719.mp4.webm", "id": "719"}, {"story": "I was at the mall the other day and decided to check out Banana Republic. While I was inside the store, I happen to check email on my phone, and I discovered that  I had received an email from Banana Republic with a \"special offer\" at the exact same minute I had walked into the store.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00721.mp4.webm", "id": "721"}, {"story": "I KNOW my phone is listening. I can't even count how many times I have had a verbal, in person conversation with a friend and been served an ad for it later that day. Stuff that I never typed in any email, chat or search.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00723.mp4.webm", "id": "723"}, {"story": "My boss and I were having a conversation where we were making jokes about the restaurant chain \"Cheddar's\". Later that evening the official Cheddar's Instagram account started following me.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00727.mp4.webm", "id": "727"}, {"story": "Recently I was complaining to my boyfriend about heatwave-related chafing annoyances and was promptly served an Instagram ad about slip shorts designed to combat that exact issue.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00728.mp4.webm", "id": "728"}, {"story": "Watching a documentary on music on TV, there was a very short interview with Frank Zappa. I happened to be on Facebook at the time, scrolling through my newsfeed, and two Frank Zappa related posts appeared, one right after the other.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00731.mp4.webm", "id": "731"}, {"story": "Colleague gave me three hard copies of the economist magazine. We talked about one of the articles. Two days later a letter came to my house asking me to subscribe to the economist. I never read the economist online nor does my wife.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00732.mp4.webm", "id": "732"}, {"story": "Colleague came into my cube and said she had just bought patio furniture. We chatted about the price, design and assembly. Next time I logged on to Facebook, the first ad in the right sidebar was for patio furniture. I never searched for patio furniture.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00734.mp4.webm", "id": "734"}, {"story": "The other day I was talking with a friend about how I needed to buy lubricant for my bicycle. Later in the day I walked to a store and bought some. I never did any online searches related to lube, the conversation took place entirely in person and I went to a bike shop that I knew by memory. The next day, I saw an ad in my Facebook feed for \"Mr. Lube\", a car service center.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00739.mp4.webm", "id": "739"}, {"story": "I was lost in another city. I was on a street, let's call it Ackerson Street. I kept repeating the name out loud while I was trying to figure out where exactly I was. I opened up Facebook Messenger and out of nowhere it suggests I contact an ex of mine who I had deleted YEARS ago. The ex's name was John Ackerson.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00740.mp4.webm", "id": "740"}, {"story": "I was searching online for a belated birthday gift for my dad. Turned out it was his last birthday, as he passed away shortly after. Retargeting ads followed me around from browser to various platforms and back to my mobile browser, for a few sad days. I didn’t end up buying anything for him as his condition worsened. When he finally passed away, the ads eerily stopped appearing.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00741.mp4.webm", "id": "741"}, {"story": "A friend texted me that he was off to Barcelona. A few minutes later I opened google translate, and it \"assumed\" I wanted to translate English to Catalan.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00743.mp4.webm", "id": "743"}, {"story": "I work in advertising, so every time I start a new client project I get ads from either my client or their competitors. This is probably based on social media tracking pixels, but sometimes I don’t even search the web, I’m simply talking about the client in its initial phase with colleagues. Within the next day, I typically get bombarded with Facebook ads.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00744.mp4.webm", "id": "744"}, {"story": "I was speaking with a friend about a record producer friend of mine from Germany whose pseudonym is Harry Kane. The next day, on my phone, in Google Now under things I may be interested in, were stories on English footballer Harry Kane. I had never googled that name nor am I a fan of English football so I don't know how else this was suggested to me.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00745.mp4.webm", "id": "745"}, {"story": "After I joked to a friend (in person) about a certain car brand, I was targeted by ads for that car.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00749.mp4.webm", "id": "749"}, {"story": "I talked to my friend about a trip, and now see ads about places to stay and offers on hotels and ads for bags, shoes and other travel gear on facebook.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00751.mp4.webm", "id": "751"}, {"story": "Was talking about a power adapter for a Gameboy Advance SP with my son sitting next to me. Never searched it before, but went over to the computer, and the first ad I saw was for that specific item.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00755.mp4.webm", "id": "755"}, {"story": "I was having a conversation with my boyfriend about how I think my memory is bad, and for the next few days saw ads related to improving reading and memory. I have not googled these. I also got an influx of follows on instagram from skincare based accounts after googling skincare clinics near me.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00756.mp4.webm", "id": "756"}, {"story": "I was in a supermarket with my partner, and we stopped and looked at a non-electronic display of a diet food supplement. Neither of us looked it up online but we both subsequently saw ads for it repeatedly for a few days.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00757.mp4.webm", "id": "757"}, {"story": "I walked past a Roto-Rooter van on my way to work. Shortly thereafter my work computer started popping up Roto-Rooter ads whenever I went to an non-work website.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00766.mp4.webm", "id": "766"}, {"story": "I was at a dinner with some friends, and I start talking with a person who I met that evening. I am Italian, and he asked me if I ever saw an Italian movie he really liked. It was an old movie which I had never heard of. The next day I saw an ad on Facebook about that movie.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00768.mp4.webm", "id": "768"}, {"story": "Once I got into a serious relationship, the ads I was targetted with drastically changed. Gone are all the \"5 tips to lose weight\", and \"find sexy singles\". Now I see roughly 5-10 ads for pregnancy tests A DAY.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00770.mp4.webm", "id": "770"}, {"story": "I bought these pineapple shaped earings, made from rubber, in a small cafe in the Queensland countryside. I paid cash. A short time later, I googled plastic jewellery on my phone, and an image of these exact same rubber earings appeared at the top of the search.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00773.mp4.webm", "id": "773"}, {"story": "My girlfriend mentioned I should get rubber fingertips for when I was preparing recruitment materials for my dissertation. I’d never heard of them, she hadn’t thought about them in years. Two hours later she starts seeing ads for rubber fingertips on her phone.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00775.mp4.webm", "id": "775"}, {"story": "Had a difficult argument with my significant other for the first time ever. Immediately after the argument, I opened Facebook just to see that the first post was a sponsored ad for relationship counseling. Never had those before, only sports betting and I don't even care about sports.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00780.mp4.webm", "id": "780"}, {"story": "Two and a half years ago I bought a car. I did not spend hours searching - I knew exactly what I wanted, and looked online at a dealer near me to see if they had it in stock, precisely once. I bought the car. For about a year afterward, I kept seeing ads for the car I had already bought.  No, I don't want 2 of them.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00786.mp4.webm", "id": "786"}, {"story": "I keep seeing ads for things I want to stop consuming.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00796.mp4.webm", "id": "796"}, {"story": "I was in a meeting with someone who has a ReMarkable tablet which I have never seen before. I asked about it, and we had a conversation, but he never mentioned the trade name. That evening it was being marketed to me on Facebook.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00802.mp4.webm", "id": "802"}, {"story": "I was thinking of getting contacts for the first time, so I was talking to my co-worker about what brand of contacts she used. I opened my Spotify window shortly after and saw an ad for that exact brand of contacts. I hadn't done any online research for contacts, or even glasses or opticians in the time surrounding this interaction.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00805.mp4.webm", "id": "805"}, {"story": "I was talking on the phone with a friend who mentioned having an ant problem at their home. I typed into my Chrome URL bar on my laptop \"how to naturally...\" and the first result was \"...get rid of ants\".", "video": "https://saaaam.s3.amazonaws.com/organs_v/00814.mp4.webm", "id": "814"}, {"story": "On vacation, playing at various golf courses. My family kept bringing up Top Golf in conversation. I never searched for it, but within a few days I was seeing ads for it on my social feed.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00821.mp4.webm", "id": "821"}, {"story": "A colleague (verbally) recommended a brand of shoes I had never heard of before. Although I was curious about them, I deliberately chose not to search for them on my work computer OR my personal device, anticipating the ads. However, she browsed their site on her work laptop while sitting next to me. By the time I got home, ads for the shoes were showing up on my Instagram, Twitter, and Facebook feeds.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00828.mp4.webm", "id": "828"}, {"story": "Hi,\n\nMy name is Randy and I was looking at a few different sites online and came across your site neworgans dot net.  I must say, your website is very impressive.  I found your website on the first page of the Search Engine. \n\nHave you noticed that 70 percent of visitors who leave your website will never return?  In most cases, this means that 95 percent to 98 percent of your marketing efforts are going to waste, not to mention that you are losing more money in customer acquisition costs than you need to.\n \nAs a business person, the time and money you put into your marketing efforts is extremely valuable.  So why let it go to waste?  Our users have seen staggering improvements in conversions with insane growths of 150 percent going upwards of 785 percent. Are you ready to unlock the highest conversion revenue from each of your website visitors?  \n\nTalkWithLead is a widget which captures a website visitor’s Name, Email address and Phone Number and then calls you immediately, so that you can talk to the Lead exactly when they are live on your website, while they're hot!\n  \nTry the TalkWithLead Live Demo now to see exactly how it works. When targeting leads, speed is essential, there is a 100x decrease in Leads when a Lead is contacted within 30 minutes vs being contacted within 5 minutes.\n\nIf you would like to talk to me about this service, please give me a call.  We do offer a 14 days free trial.  \n\nThanks and Best Regards,\nRandy", "video": "https://saaaam.s3.amazonaws.com/organs_v/00829.mp4.webm", "id": "829"}, {"story": "My wife and I were talking in the truck this morning about going back to school for a specific certification. Then when I opened my Chromebook about half an hour later, all of the ads on Facebook were for online course programs.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00837.mp4.webm", "id": "837"}, {"story": "I was at my job and needed to refill the printer paper. The paper we use at my office is Hammermill Color Copy 28lb, so I was searching for a package of that paper all over our supply room for 20 minutes, but didn’t ask or tell anyone about it. Later that night, I was scrolling through a page on my phone and saw an ad for the exact paper I’d been searching for. I don’t buy the supplies for my office, so there’s no reason why I would have searched or shopped for the paper before.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00841.mp4.webm", "id": "841"}, {"story": "I was watching Drunk History on Comedy Central, a show that I've never watched before, nor had a desire to watch. I've never searched for information about the show either. As far as I know, my online presence is completely devoid of any connection to Drunk History. So I was pretty surprised when, the following night, I was served an ad for Drunk History on Facebook. HOW DID THEY KNOW?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00845.mp4.webm", "id": "845"}, {"story": "I bought 5 gum because they were out of trident.  I never buy 5 gum.  A few hours later, I got an ad on instagram stories for 5 gum.  I've never seen a gum ad via instagram stories in my life.  Let alone, 5 gum.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00855.mp4.webm", "id": "855"}, {"story": "My coworker was in her first trimester of pregnancy and hadn’t told anyone else at work. I started receiving ads for baby toys, clothes, and pregnancy items while browsing various sites on my work computer. I definitely didn't research gifts for her on my work computer and honestly I dont think I even thought about or looked for gifts at all until much later in her pregnancy.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00857.mp4.webm", "id": "857"}, {"story": "I opened up about my depression with two close friends. I gave details and talked about the idea of getting therapy. The next day I was targeted with an add for Rundum Gesund Ergotherapy, a company that offers a weird kind of therapy.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00858.mp4.webm", "id": "858"}, {"story": "I feel anxious about straightening my teeth as I should have done it years ago, but always end up procrastinating. I probably only spoke about it once or twice with friends or with my parents on the phone. Yet I see ads for dentists or dental care services quite often on Facebook.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00866.mp4.webm", "id": "866"}, {"story": "I was in my room making music with a few friends. Most of us smoke cannabis but one of us doesn't. CBD and THC oils/wax came up in conversation between the smokers. Around 5 mins after this our friend looked at her facebook account, and was hit by a surprise: ads for medical CBD oils for sale.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00874.mp4.webm", "id": "874"}, {"story": "I was on a hike with my friend, talking about plant ID apps (none of which I have ever googled or downloaded before), was taking photos of plants on our hike, and 2 days later I started getting targeted ads in my facebook feed for plant ID apps.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00875.mp4.webm", "id": "875"}, {"story": "I had a real world conversation with a friend about mayo and tuna salad. My phone was on the table and I was on Facebook intermittently before and during this conversation. The next day I saw an ad for a tuna company (Clover Leaf) on Facebook consisting of a recipe for quinoa tuna salad.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00876.mp4.webm", "id": "876"}, {"story": "Among the suggested friends on Linkedin I found a person I met through an online dating service. Linkedin and the app don't share the same email address. How did Linkedin know I knew that person?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00878.mp4.webm", "id": "878"}, {"story": "I had a conversation with my friends about backpacks on a private chat on Facebook. I mentioned a brand, and the next day this particular brand is the only ad Facebook shows on my timeline. I never searched for these bags on the internet because I already knew what they looked like.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00917.mp4.webm", "id": "917"}, {"story": "I am a woman, and I am 26 years old, and I am constantly targeted by ads for pregnancy tests and dating sites. I do not need either.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00921.mp4.webm", "id": "921"}, {"story": "I moved recently. I did not activate geolocation, but google shows me ads near my new address.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00922.mp4.webm", "id": "922"}, {"story": "I was talking on the phone about a street where I was supposed to meet some friends, and the first suggestion in Google Map was this street. I've never been to this street  before.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00925.mp4.webm", "id": "925"}, {"story": "My partner and I met a friend for breakfast in Berlin. We were visiting from Melbourne. We told him about our flight over, and described the budget airline, Scoot, that we had flown with. He had never heard of them and was asking us questions. Later that day, he sent us both a screenshot of a Scoot ad in his facebook feed.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00926.mp4.webm", "id": "926"}, {"story": "Was talking to my girlfriend about long-distance overseas calls, and within the time I talked about it, and the next time I used my iPhone, I got an ad for long distance overseas phone services.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00927.mp4.webm", "id": "927"}, {"story": "Facebook tries to guess my sexual orientation by suggesting friends. One day it suggests only half naked guys and the next day only sexy girls.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00932.mp4.webm", "id": "932"}, {"story": "I was eyeing a friend’s IWC watch. Didn’t google it, didn’t look it up, didn’t talk to anyone about it. That night, I was scrolling through Instagram and for the first time, saw an IWC ad pop up.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00940.mp4.webm", "id": "940"}, {"story": "One time my history class talked about the opioid epidemic, and later on my twitter timeline there was an ad for an opioid addiction clinic. So weird.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00945.mp4.webm", "id": "945"}, {"story": "I told my husband, without ever typing any of this, that my breasts are tender lately, and I'm worried. He suggested it was the bras, and I should look for something less constricting. Minutes later, scrolling facebook, there was a sponsored ad about some new type of bra.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00946.mp4.webm", "id": "946"}, {"story": "I heard about Danner boots for the first time at Thanksgiving. My phone was sitting on the counter, when someone mentioned their new kicks. I've never looked for shoes online, but had Danner boot ads in my Instagram feed for the next 2 weeks.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00948.mp4.webm", "id": "948"}, {"story": "I heard a Spotify ad which mentioned \"oysters rockefeller\", which then immediately appeared as a suggestion after typing in \"oysters\" to my Google. I have often (and recently) searched multiple oyster related queries, but unrelated to anything culinary.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00949.mp4.webm", "id": "949"}, {"story": "This morning I borrowed my sister's \"Maxmara\" purse, a well known brand. I didn't speak about it to ANYONE, or google it. I just grabbed the purse and went on my way. Scrolling through Instagram at work I came across a \"Maxmara\" ad, that I've NEVER seen before. That's when I stopped everything I was doing and realized, we as a society are being watched.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00950.mp4.webm", "id": "950"}, {"story": "My friend did an art project at school. A couple of days later, I saw a very similar art project on my instagram discovery page. I no longer use instagram.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00953.mp4.webm", "id": "953"}, {"story": "Had a conversation about our favourite chocolate brand with my dad and discovered an ad for this brand the next day on my instagram account.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00954.mp4.webm", "id": "954"}, {"story": "Went to a shop that sells a well known brand of sneakers. I didn't do any web research about it, just went there with a friend who wanted to buy these shoes. Later that day day, I saw ads for the sneakers on facebook.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00955.mp4.webm", "id": "955"}, {"story": "I was talking to a friend about another common friend we both had not seen for 2 years that had moved from to Ireland 6 months earlier. We mentioned her name several times aloud. I then wanted to show her the family picture of them announcing they had moved to Ireland. I opened Facebook and the first item in my feed was the post of that picture.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00956.mp4.webm", "id": "956"}, {"story": "Chat with a friend about the movies \"Alien\" and \"Mad Max\". The day after, Facebook suggested that I buy the complete Blue Ray collection of Alien AND Mad Max. No internet trace of that discussion. Only our smartphones witnessed it.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00957.mp4.webm", "id": "957"}, {"story": "I went to a new doctor. In order to update my medical file, I told him about an eating disorder I had 15 years ago. This is a thing of the past that I tend to forget, so I never speak nor write about it. But when I scrolled down my Facebook on my way home, an ad I had never seen before was offering personnal help for exactly the kind of disorder I had described earlier to the doctor.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00959.mp4.webm", "id": "959"}, {"story": "My husband showed me a trailer for an old movie on his phone, then for the next few days I was shown several ads for that movie across Facebook and Instagram, despite never having googled it.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00960.mp4.webm", "id": "960"}, {"story": "At a party, had a good contact with a girl. Nothing happened, we both went our separate ways. Later, she was the first friend suggestion on facebook.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00962.mp4.webm", "id": "962"}, {"story": "One day I was at a restaurant with a friend. She asked me where I got my bag, and what brand it was. I told her the name of the brand. A few minutes later she checks something on facebook, and oh, what a surprise, an ad about that brand appeared. We couldn't believe how creepy it was.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00963.mp4.webm", "id": "963"}, {"story": "My friends and I visited an ice cream shop in Stockholm and discussed getting hazelnut icecream. A few hours later, saw an ad on my instagram feed for hazelnut ice cream.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00968.mp4.webm", "id": "968"}, {"story": "I am not active on social media but I recently visited Reddit's \"awww\" group, where cute pics of animals are shared. I do not have a cat and have never upvoted a cat pic, but I did say aloud to my family something like \"aww, cats really are cute, I kinda wish we could have a cat\". Within 24 hours, I received Amazon newsletters in my e-mail that were completely focused on suggested products for my non-existent cat.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00969.mp4.webm", "id": "969"}, {"story": "I had an eye test on Friday, went to look for some new glasses on Saturday. No googling or searching in the meantime. Sunday afternoon, I see an ad for exactly the same glasses I tried on my Instagram feed.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00970.mp4.webm", "id": "970"}, {"story": "I have a yeast infection. I haven't told anyone or googled anything. I haven't verbally said or typed about it whatsoever, but I got an ad for Canesten cream on Instagram. How did they know?", "video": "https://saaaam.s3.amazonaws.com/organs_v/00972.mp4.webm", "id": "972"}, {"story": "Three times now I have gotten ads for grocery items I already purchased.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00973.mp4.webm", "id": "973"}, {"story": "I received an ad on Amazon for an orthopedic pillow that my doctor recommended me a few weeks ago. I've talked to my wife about it but never did any research on the web.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00978.mp4.webm", "id": "978"}, {"story": "I went to Target with my friend and purchased a Hillshire Farms snack, essentially a fancy version of a lunchable. I bought it with my credit card and gave it to my friend to eat. Later that evening we both got sponsored ads on Instagram for the Hillshire Farms product I had purchased.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00980.mp4.webm", "id": "980"}, {"story": "I took a photo of the label of a pair of Lee jeans on my iPad,. The first ad I was showed on Instagram was for Lee jeans. I have never searched online anywhere for Lee jeans.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00981.mp4.webm", "id": "981"}, {"story": "Instagram served me an ad for becoming a Bird electric scooter mechanic. The night before I'd listened to a podcast on my phone where they discussed becoming Bird scooter mechanics.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00989.mp4.webm", "id": "989"}, {"story": "I sent my friend a photo on Instagram DM of an old hockey stick that I used in high school. The first ad I saw after that was for a sporting goods store. The product on the ad was a hockey stick.", "video": "https://saaaam.s3.amazonaws.com/organs_v/00996.mp4.webm", "id": "996"}, {"story": "I play a pen & paper RPG and keep getting ads and video recommendations for things I referred to while in character.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01006.mp4.webm", "id": "1006"}, {"story": "Shopping at GoodGuys for a vacuum, toaster and kettle, all purchased. Had a brief discussion with a sales assistant about air purifiers. Two days later a sponsored ad appeared on Instagram for Dyson Air Purifiers.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01008.mp4.webm", "id": "1008"}, {"story": "I dropped by my neighborhood Whole Earth Provision Co. in Austin, TX, early evening to do some early Christmas shopping. I was briefly drawn to this outdoorsy Star Trek looking ladies coat, but quickly walked away after I saw the $550 price tag. It showed up as an ad in my Facebook feed an hour later.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01022.mp4.webm", "id": "1022"}, {"story": "One time I was at you a small party and I was talking to my friend and we were talking about what shoes we wanted to get and I said I was going to get some nike cortezs and 10 mins later I went on instagram and saw a nike ad for cortezs.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01023.mp4.webm", "id": "1023"}, {"story": "My great aunts house, where I spent much of my childhood, just popped up as an AirB&B sponsored post on Instagram.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01025.mp4.webm", "id": "1025"}, {"story": "My husband was searching for specific bike parts on his phone one morning. That evening he picks up MY phone and starts scrolling through my Instagram. All of a sudden, he sees ads for those specific bike parts on my phone!", "video": "https://saaaam.s3.amazonaws.com/organs_v/01031.mp4.webm", "id": "1031"}, {"story": "I was talking with a friend about how it might be cool to take up rock climbing. That afternoon I got a push ad on instagram for rock climbing at a gym. I staged an experiment with colleagues where we talked about soy milk all day, and sure enough there were ads for soy milk on all our phones over the next few days.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01033.mp4.webm", "id": "1033"}, {"story": "Yesterday I was showing my brother how to change motor fluid in the right in a car outside my house. We took my brother's phone to have some light to see in the hood. When we came back inside the house, 5-10 min later, I had ads on Facebook about changing oil in a car.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01036.mp4.webm", "id": "1036"}, {"story": "A friend of mine posted a picture to her Instagram story of our professor that I thought was funny. I took a screenshot of it. When I opened Instagram again a few hours later, I got a targeted ad for the unique sweatshirt that my professor was wearing in the picture that I had screenshot.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01038.mp4.webm", "id": "1038"}, {"story": "My husband was commenting on how shallow my pockets were compared to his. About a week later I saw an ad for women's jeans with deep pockets.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01043.mp4.webm", "id": "1043"}, {"story": "Gifts purchased by others for my child’s birthday party showed up in my instagram ads within hours of the party. One included an English version of an ad for a German board game.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01044.mp4.webm", "id": "1044"}, {"story": "When I changed my period tracker app's status to pregnant I got targetted ads in instagram for all things kid related. I had a miscarriage at 12 weeks and I re-set my period tracker app, and I even posted publicly in both instragam and facebook posts using the word miscarriage. However I got baby related ads for another 6 weeks or so even though I tagged each post irrelevant and wrote to instagram asking them to desist from targetting baby stuff at me given how insensitive that was.", "video": "https://saaaam.s3.amazonaws.com/organs_v/01047.mp4.webm", "id": "1047"}, {"story": "I bought some shoes for my new baby niece in a branch of an upmarket kids shop, and told my husband about it over whatsapp. Several days later HE was served a Facebook ad for the shop’s online business, featuring the exact same shoes in the same colour I had bought, with the message “forgotten something”?", "video": "https://saaaam.s3.amazonaws.com/organs_v/01048.mp4.webm", "id": "1048"}]